#    -*- mode: org -*-


Archived entries from file c:/Users/tyler/AppData/Roaming/Orgfiles/SEAS.org


* DONE Create task list for day
CLOSED: [2022-12-19 Mon 16:49] SCHEDULED: <2022-12-19 Mon 11:35>
:PROPERTIES:
:ARCHIVE_TIME: 2022-12-20 Tue 14:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: tasks
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS @office
:END:
:LOGBOOK:
CLOCK: [2022-12-19 Mon 11:36]--[2022-12-19 Mon 12:10] =>  0:34
:END:
 [2022-12-19 Mon 11:35]
 [[file:~/Orgfiles/SEAS.org::*Build Email for gear sales][Build Email for gear sales]]


* DONE Build Email for gear sales
CLOSED: [2022-12-19 Mon 16:49] SCHEDULED: <2022-12-19 Mon 11:45>
:PROPERTIES:
:ARCHIVE_TIME: 2022-12-20 Tue 14:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: tasks
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS @office
:END:
:LOGBOOK:
CLOCK: [2022-12-19 Mon 12:10]--[2022-12-19 Mon 16:13] =>  4:03
CLOCK: [2022-12-19 Mon 11:35]--[2022-12-19 Mon 11:35] =>  0:00
:END:
 [2022-12-19 Mon 11:34]


* DONE Read & Catch up on News
CLOSED: [2023-01-18 Wed 11:22] SCHEDULED: <2023-01-18 Wed 10:45>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 10:46]--[2023-01-18 Wed 11:22] =>  0:36
:END:
 [2023-01-18 Wed 10:44]


* DONE Lunch Break
CLOSED: [2023-01-18 Wed 15:11] SCHEDULED: <2023-01-18 Wed 13:30>
:PROPERTIES:
:Effort:   60
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
:END:
 [2023-01-18 Wed 11:50]


* DONE Plan Remainder of week and next weeks tasks
CLOSED: [2023-01-18 Wed 15:10] SCHEDULED: <2023-01-18 Wed 12:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 13:46]--[2023-01-18 Wed 14:02] =>  0:16
CLOCK: [2023-01-18 Wed 13:04]--[2023-01-18 Wed 13:04] =>  0:00
CLOCK: [2023-01-18 Wed 12:51]--[2023-01-18 Wed 12:56] =>  0:05
CLOCK: [2023-01-18 Wed 11:58]--[2023-01-18 Wed 12:51] =>  0:53
:END:
 [2023-01-18 Wed 11:51]
 [[file:~/Orgfiles/SEAS.org::*Lunch Break][Lunch Break]]


* DONE Create SEAS news letter in Mailchimp
CLOSED: [2023-01-19 Thu 16:37] SCHEDULED: <2023-01-19 Thu 10:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-19 Thu 11:26]--[2023-01-19 Thu 16:37] =>  5:11
:END:
 [2023-01-18 Wed 13:07]


* DONE Get News Letter Approved by Zack
CLOSED: [2023-01-20 Fri 15:03] SCHEDULED: <2023-01-20 Fri 11:30>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-20 Fri 12:36]--[2023-01-20 Fri 12:57] =>  0:21
CLOCK: [2023-01-20 Fri 11:25]--[2023-01-20 Fri 11:30] =>  0:05
CLOCK: [2023-01-19 Thu 16:37]--[2023-01-19 Thu 16:47] =>  0:10
:END:
 [2023-01-18 Wed 13:08]


* DONE Confirm server room has a slot for the cienna to move to
CLOSED: [2023-01-18 Wed 15:32] SCHEDULED: <2023-01-18 Wed 14:15>
:PROPERTIES:
:Effort:   15
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:26]--[2023-01-18 Wed 15:32] =>  0:06
:END:
 [2023-01-18 Wed 13:13]


* DONE Clean up Gmail
CLOSED: [2023-01-18 Wed 17:04] SCHEDULED: <2023-01-18 Wed 16:45>
:PROPERTIES:
:Effort:   1:15
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 16:54]--[2023-01-18 Wed 17:04] =>  0:10
:END:
 [2023-01-18 Wed 13:14]


* DONE Schedule the week
CLOSED: [2023-01-23 Mon 14:40] SCHEDULED: <2023-01-23 Mon 13:45>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 13:52]--[2023-01-23 Mon 14:38] =>  0:46
CLOCK: [2023-01-23 Mon 13:40]--[2023-01-23 Mon 13:52] =>  0:12
:END:
 [2023-01-23 Mon 13:39]


* DONE Migrate tasks from SEAS Notion into org
CLOSED: [2023-01-23 Mon 16:34] SCHEDULED: <2023-01-23 Mon 15:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 15:59]--[2023-01-23 Mon 16:34] =>  0:35
CLOCK: [2023-01-23 Mon 15:32]--[2023-01-23 Mon 15:57] =>  0:25
:END:
 [2023-01-23 Mon 14:38]


* DONE Meet with Bridge-Rev 
CLOSED: [2023-01-24 Tue 16:07] SCHEDULED: <2023-01-24 Tue 12:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-24 Tue 12:28]--[2023-01-24 Tue 12:28] =>  0:00
:END:
 [2023-01-23 Mon 15:59]
 


* MEETING with Matt                                                 :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 12:39]--[2023-01-30 Mon 13:13] =>  0:34
:END:
[2023-01-30 Mon 12:39]


Nextcloud.com to look into the dropbox style setup.
Bridged nics need to be onsite and/or dashboard access from ryan. 

* DONE Read & Catch up on News
CLOSED: [2023-01-18 Wed 11:22] SCHEDULED: <2023-01-18 Wed 10:45>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-07 Tue 12:05
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 10:46]--[2023-01-18 Wed 11:22] =>  0:36
:END:
 [2023-01-18 Wed 10:44]


* DONE Lunch Break
CLOSED: [2023-01-18 Wed 15:11] SCHEDULED: <2023-01-18 Wed 13:30>
:PROPERTIES:
:Effort:   60
:ARCHIVE_TIME: 2023-03-07 Tue 12:05
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
:END:
 [2023-01-18 Wed 11:50]


* DONE Plan Remainder of week and next weeks tasks
CLOSED: [2023-01-18 Wed 15:10] SCHEDULED: <2023-01-18 Wed 12:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 13:46]--[2023-01-18 Wed 14:02] =>  0:16
CLOCK: [2023-01-18 Wed 13:04]--[2023-01-18 Wed 13:04] =>  0:00
CLOCK: [2023-01-18 Wed 12:51]--[2023-01-18 Wed 12:56] =>  0:05
CLOCK: [2023-01-18 Wed 11:58]--[2023-01-18 Wed 12:51] =>  0:53
:END:
 [2023-01-18 Wed 11:51]
 [[file:~/Orgfiles/SEAS.org::*Lunch Break][Lunch Break]]


* DONE Create SEAS news letter in Mailchimp
CLOSED: [2023-01-19 Thu 16:37] SCHEDULED: <2023-01-19 Thu 10:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-19 Thu 11:26]--[2023-01-19 Thu 16:37] =>  5:11
:END:
 [2023-01-18 Wed 13:07]


* DONE Get News Letter Approved by Zack
CLOSED: [2023-01-20 Fri 15:03] SCHEDULED: <2023-01-20 Fri 11:30>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-20 Fri 12:36]--[2023-01-20 Fri 12:57] =>  0:21
CLOCK: [2023-01-20 Fri 11:25]--[2023-01-20 Fri 11:30] =>  0:05
CLOCK: [2023-01-19 Thu 16:37]--[2023-01-19 Thu 16:47] =>  0:10
:END:
 [2023-01-18 Wed 13:08]


* DONE Confirm server room has a slot for the cienna to move to
CLOSED: [2023-01-18 Wed 15:32] SCHEDULED: <2023-01-18 Wed 14:15>
:PROPERTIES:
:Effort:   15
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:26]--[2023-01-18 Wed 15:32] =>  0:06
:END:
 [2023-01-18 Wed 13:13]


* DONE Clean up Gmail
CLOSED: [2023-01-18 Wed 17:04] SCHEDULED: <2023-01-18 Wed 16:45>
:PROPERTIES:
:Effort:   1:15
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 16:54]--[2023-01-18 Wed 17:04] =>  0:10
:END:
 [2023-01-18 Wed 13:14]


* DONE Schedule the week
CLOSED: [2023-01-23 Mon 14:40] SCHEDULED: <2023-01-23 Mon 13:45>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 13:52]--[2023-01-23 Mon 14:38] =>  0:46
CLOCK: [2023-01-23 Mon 13:40]--[2023-01-23 Mon 13:52] =>  0:12
:END:
 [2023-01-23 Mon 13:39]


* DONE Migrate tasks from SEAS Notion into org
CLOSED: [2023-01-23 Mon 16:34] SCHEDULED: <2023-01-23 Mon 15:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 15:59]--[2023-01-23 Mon 16:34] =>  0:35
CLOCK: [2023-01-23 Mon 15:32]--[2023-01-23 Mon 15:57] =>  0:25
:END:
 [2023-01-23 Mon 14:38]


* DONE Meet with Bridge-Rev 
CLOSED: [2023-01-24 Tue 16:07] SCHEDULED: <2023-01-24 Tue 12:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-24 Tue 12:28]--[2023-01-24 Tue 12:28] =>  0:00
:END:
 [2023-01-23 Mon 15:59]
 


* MEETING with Matt                                                 :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 12:39]--[2023-01-30 Mon 13:13] =>  0:34
:END:
[2023-01-30 Mon 12:39]


Nextcloud.com to look into the dropbox style setup.
Bridged nics need to be onsite and/or dashboard access from ryan. 

** PHONE Mayitas Tacos                                               :PHONE:
:LOGBOOK:
CLOCK: [2023-01-26 Thu 14:08]--[2023-01-26 Thu 14:15] =>  0:07
:END:
[2023-01-26 Thu 14:08]

*Tacos & Salsa* 

$14 per person
 
Tacos w/ rice beans & salsa Horchata type drinks

Minimum is 50  ($750)

$75 for travel 

$15 per person


200 people.

Carne Asada
Chicken
 Al Pastor
 Chilorrio - shredded pork + red chile

 Alexander - 951-588-9190
 
* DONE Transfer video from Momentous Show (truck coming in)
CLOSED: [2023-02-02 Thu 11:09] SCHEDULED: <2023-01-31 Tue>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-04-05 Wed 11:37
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 12:28]--[2023-01-30 Mon 12:28] =>  0:00
:END:
 [2023-01-26 Thu 16:16]


* DONE Plan next 2 weeks
CLOSED: [2023-02-22 Wed 11:26] SCHEDULED: <2023-02-22 Wed 11:00>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-04-05 Wed 11:37
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-02-22 Wed 10:49]--[2023-02-22 Wed 11:26] =>  0:37
:END:
 [2023-02-22 Wed 10:49]



* MEETING with Bridge Rev                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-04-05 Wed 14:55
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-02-14 Tue 13:20]--[2023-02-14 Tue 14:29] =>  1:09
:END:
[2023-02-14 Tue 13:20]

- COlumn width not changable
- Setup interlinking for asana
- More than 4 properties is not possible
- Biz Dev Pipeline - manual
- Probably best to build a new site instead of go with the old one
  

* MEETING with George                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-06-01 Thu 11:31
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-04-26 Wed 16:30]--[2023-04-26 Wed 17:24] =>  0:54
:END:
[2023-04-26 Wed 16:29]

* MEETING with George                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-06-10 Sat 15:21
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-04-26 Wed 16:30]--[2023-04-26 Wed 17:24] =>  0:54
:END:
[2023-04-26 Wed 16:29]

** DONE Add Hubspot embed code
CLOSED: [2023-01-30 Mon 14:55] SCHEDULED: <2023-01-30 Mon 15:00>
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 14:46]--[2023-01-30 Mon 14:55] =>  0:09
:END:
 [2023-01-26 Thu 12:00]

<!-- Start of HubSpot Embed Code -->
<script type="text/javascript" id="hs-script-loader" async defer src="//js.hs-scripts.com/23772871.js"></script>
<!-- End of HubSpot Embed Code -->

[[https://t.sidekickopen84.com/s3t/c/5/f18dQhb0V1-gnj8fD6VyW2LL_8b2B9nMJN7t5XWPf2rmRW2Bpn224XrfJdW16gGCb89l_0Q101?te=W3R5hFj4cm2zwW3X-qTw3ZVc6BW3JFvSV3CfBPBW4fdHZS3_rjd5W45SB6d4cgzsKW4cQgwb3ZrXZbW3JF4nf3CfBPBW4fdh-T3z8nfwF41S2fpPbML1&si=8000000025871155&pi=fb193d5e-cb52-4165-b27e-c46a92837def][HOW TO Link]]
* MEETING with Taco Tuesdays                                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-03 Wed 11:08]--[2023-05-03 Wed 11:15] =>  0:07
:END:
[2023-05-03 Wed 11:08]

- Taco tuesdays are tech and teaching
- 1 client per sales guy as a quota
- This upcoming one:
  - Ground support - Setup 2 coloumns
  - Led wall with ground support
  - S Curve LED
    

* DONE Meet with Phil Mershon re Keynote
CLOSED: [2023-05-03 Wed 17:23] SCHEDULED: <2023-05-03 Wed 16:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-03 Wed 16:31]--[2023-05-03 Wed 17:23] =>  0:52
:END:
 [2023-05-03 Wed 15:51]
* DONE Update Agenda & Tasks
CLOSED: [2023-05-04 Thu 13:13] SCHEDULED: <2023-05-04 Thu 11:15>
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 11:13]--[2023-05-04 Thu 13:13] =>  2:00
:END:
 [2023-05-03 Wed 15:52]


* DONE Meet with Jeff re Hubspot
CLOSED: [2023-05-03 Wed 16:22] SCHEDULED: <2023-05-03 Wed 15:55>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-03 Wed 15:57]--[2023-05-03 Wed 16:22] =>  0:25
:END:
 [2023-05-03 Wed 15:54]


* DONE Meet with Michael
CLOSED: [2023-05-05 Fri 15:11] SCHEDULED: <2023-05-05 Fri 14:15>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-05 Fri 14:15]--[2023-05-05 Fri 15:10] =>  0:00
:END:
 [2023-05-04 Thu 10:56]


* DONE Plan out May
CLOSED: [2023-05-05 Fri 13:10] SCHEDULED: <2023-05-05 Fri 11:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-05 Fri 12:04]--[2023-05-05 Fri 13:10] =>  1:06
CLOCK:  [2023-05-05 Fri 11:00]
:END:
[2023-05-05 Fri 11:00]


* DONE Lunch
CLOSED: [2023-05-05 Fri 14:14] SCHEDULED: <2023-05-05 Fri 13:00>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-05 Fri 13:10]--[2023-05-05 Fri 14:14] =>  1:04
:END:
 [2023-05-05 Fri 11:13]


* DONE Finalize pricing sheet
CLOSED: [2023-05-10 Wed 16:46] SCHEDULED: <2023-05-10 Wed 13:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-10 Wed 13:32]--[2023-05-10 Wed 16:46] =>  3:14
CLOCK: [2023-05-09 Tue 12:41]--[2023-05-09 Tue 16:58] =>  4:17
- State "NEXT"       from "WAITING"    [2023-05-09 Tue 11:23]
- State "WAITING"    from "TODO"       [2023-05-05 Fri 11:41] \\
  Waiting on the data from Josh
:END:
 [2023-05-05 Fri 11:40]


* DONE Lunch
CLOSED: [2023-05-08 Mon 13:28] SCHEDULED: <2023-05-08 Mon 12:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-08 Mon 12:51]--[2023-05-08 Mon 13:28] =>  0:37
:END:
 [2023-05-05 Fri 11:56]


* DONE Clear out email
CLOSED: [2023-05-15 Mon 13:32] SCHEDULED: <2023-05-12 Fri 11:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-15 Mon 13:04]--[2023-05-15 Mon 13:32] =>  0:28
:END:
 [2023-05-05 Fri 12:34]


* MEETING with Proposify                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 13:30]--[2023-05-04 Thu 13:45] =>  0:15
:END:
[2023-05-04 Thu 13:30]

Content table vs Fee Table. ($ won't show up in a content table.)

The tables can link but they must stay in the same "section" but can span multiple pages.

* MEETING 05/10 Managers                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-10 Wed 09:05]--[2023-05-10 Wed 09:53] =>  0:48
:END:
[2023-05-10 Wed 09:05]

* MEETING  with Julie & Zack RE Phil Mershon Speaking Gig           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 11:02]--[2023-05-17 Wed 12:21] =>  1:19
:END:
[2023-05-17 Wed 11:02]

Email Frequency?

Who attended which 

- Who are we emailing within the
- Up to 5k

workflows
- Remove do not contact from marketing contact as a workflow item.
- As people are added always make them a marketing contact.
- If cold lead + george is owner + no response
- Active marketing cold leads list
- Active marketing everyone else

- First email blast is not cold leads
  

  - Add more contact limit
  - Clean contact types & make it required
  - Update sales guys on the use of Other as contact type
  - create our lists for this event cold leads & non cold leads
  - Clean up George's bulk imports
  - Create the Campaign
  - Blast non-cold leads
  - hit cold leads on the next one (friday)

  - Check & Update first / last name across contacts

  - Figure out how to update the default "about" section for hubspot plugin in gmail

  - Agency
  - End Client
  - Event planner
  - Event producer
  - event promoter
  - Non Profit
  - University



  

* MEETING with Josh RE purchases for Broadcast room                 :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 14:56]--[2023-05-17 Wed 15:46] =>  0:50
:END:
[2023-05-17 Wed 14:56]

** DONE Setup webpage for streaming 
CLOSED: [2023-06-14 Wed 17:17] SCHEDULED: <2023-06-14 Wed 10:30>
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-06-14 Wed 15:21]--[2023-06-14 Wed 17:17] =>  1:56
CLOCK: [2023-06-14 Wed 10:22]--[2023-06-14 Wed 11:00] =>  0:38
:END:
 [2023-06-14 Wed 10:20]


* MEETING with Julies & Syd - Final Meeting to go over Phil Mershon event. :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-12 Mon 07:31]--[2023-06-12 Mon 08:45] =>  1:14
:END:
[2023-06-12 Mon 11:31]

- Count tables
- Count chairs
- Store trip tuesday for drink stuff
- Sign In sheet
- Name tags
- Confirm Erica (josh is bartending)
- Build a website for stream
- Cnfirm employee attmendance
- sean & ruben handling technical setup wed
- sweep vacumm the studio
- 

* DONE Fill in worksheet for Hubspot/Quickbooks
CLOSED: [2023-06-28 Wed 16:35] SCHEDULED: <2023-06-27 Tue 14:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-28 Wed 14:07]--[2023-06-28 Wed 16:35] =>  2:28
CLOCK: [2023-06-28 Wed 011:50]--[2023-06-28 Wed 12:40] => 12:40
CLOCK: [2023-06-27 Tue 14:17]--[2023-06-27 Tue 16:05] =>  1:48

:END:
 [2023-06-20 Tue 14:38]
[[https://docs.google.com/spreadsheets/d/1_odjTvrWsuGkNNBSHXfqa5XAsw5P518I0wAzM4H9ydk/edit#gid=1108629813][Hubspot / Quickbooks Worksheet]]

* MEETING with Nick Michael & Julie re: Package Pricing             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-16 Fri 10:03]--[2023-06-16 Fri 10:43] =>  0:40
:END:
[2023-06-16 Fri 10:03]


Behr - 170k / 85k

- General Session Package
- Breakout package
- Pre-Function Space
- 
  

* MEETING with Sales Team                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-16 Fri 08:23]--[2023-06-16 Fri 09:05] =>  0:42
:END:
[2023-06-16 Fri 08:23]

- Get 2 more cameras
- Get power supplies
- Send Nick photos. 

* MEETING with Justin & Zack - Hubspot revenue tracking             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-19 Mon 10:12]--[2023-06-19 Mon 11:15] =>  1:03
:END:
[2023-06-19 Mon 10:12]

Total Amount in company currency -
Intial Budget
Starting Amount - > workflow to make sure initial numbers

* MEETING with SEAS Team [Manager Meeting]                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-19 Mon 12:12]--[2023-06-19 Mon 13:04] =>  0:52
:END:
[2023-06-19 Mon 12:12]


* MEETING with SEAS Team [Manager Meeting]                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-19 Mon 12:12]--[2023-06-19 Mon 13:04] =>  0:52
:END:
[2023-06-19 Mon 12:12]

* MEETING marketing meeting with Troy Julie Zack                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-28 Wed 13:28]--[2023-06-28 Wed 14:06] =>  0:38
:END:
[2023-06-28 Wed 13:28]
* MEETING with Sales Team (weekly sales meeting)                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-30 Fri 08:03]--[2023-06-30 Fri 08:56] =>  0:53
:END:
[2023-06-30 Fri 08:03]


* MEETING with Sales Team (weekly sales meeting)                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-30 Fri 08:03]--[2023-06-30 Fri 08:56] =>  0:53
:END:
[2023-06-30 Fri 08:03]

* DONE Location Based Deal report
CLOSED: [2023-06-29 Thu 11:36] SCHEDULED: <2023-06-29 Thu 10:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-14 Mon 15:14
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/BridgeRev Hubspot Setup
:ARCHIVE_CATEGORY: Project
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-29 Thu 10:05]--[2023-06-29 Thu 11:36] =>  1:31
:END:


** DONE Create Signature for Ruben
CLOSED: [2023-05-08 Mon 11:41] SCHEDULED: <2023-05-08 Mon 11:00>
:LOGBOOK:
CLOCK: [2023-05-08 Mon 11:10]--[2023-05-08 Mon 11:41] =>  0:31
:END:

** DONE Create Signature for Craig
CLOSED: [2023-07-17 Mon 15:45] SCHEDULED: <2023-07-18 Tue 10:30>
:LOGBOOK:
CLOCK: [2023-06-27 Tue 14:15]--[2023-06-27 Tue 14:17] =>  0:02
- State "NEXT"       from "WAITING"    [2023-06-12 Mon 00:52]
- State "WAITING"    from "TODO"       [2023-05-05 Fri 11:55] \\
  Waiting on photo from Julie
:END:

* DONE Update Signatures
CLOSED: [2023-07-17 Mon 15:44] SCHEDULED: <2023-07-17 Mon 12:15>
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 13:26]--[2023-07-17 Mon 15:44] =>  2:18
:END:
 [2023-07-13 Thu 11:36]

- [X] Zack
- [X] Troy
- [X] Mitch
- [X] Jeff


* DONE Plan the Day
CLOSED: [2023-07-17 Mon 11:42] SCHEDULED: <2023-07-17 Mon 11:40>
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 11:37]--[2023-07-17 Mon 11:42] =>  0:05
CLOCK: [2023-07-17 Mon 11:37]--[2023-07-17 Mon 11:37] =>  0:00
:END:
 [2023-07-17 Mon 11:37]


* DONE Clean Up Project Files on PC
CLOSED: [2023-07-18 Tue 14:11] SCHEDULED: <2023-07-18 Tue 11:15>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 15:46]--[2023-07-17 Mon 16:30] =>  0:44
:END:
 [2023-07-17 Mon 11:38]


* DONE Edit Lasso Podcast
CLOSED: [2023-07-26 Wed 17:17] SCHEDULED: <2023-07-26 Wed 13:45>
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-26 Wed 16:54]--[2023-07-26 Wed 17:17] =>  0:23
:END:
 [2023-07-17 Mon 11:39]


* DONE Lunch
CLOSED: [2023-07-17 Mon 12:13] SCHEDULED: <2023-07-17 Mon 11:45>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 11:42]--[2023-07-17 Mon 12:13] =>  0:31
:END:
 [2023-07-17 Mon 11:41]


* DONE Lunch
CLOSED: [2023-07-19 Wed 14:19] SCHEDULED: <2023-07-19 Wed 12:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-19 Wed 13:59]--[2023-07-19 Wed 14:19] =>  0:20
CLOCK: [2023-07-19 Wed 12:36]--[2023-07-19 Wed 13:59] =>  1:23
:END:
 [2023-07-19 Wed 11:44]


* DONE Trouble shoot Julies PC
CLOSED: [2023-07-26 Wed 13:45]
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-26 Wed 11:30]--[2023-07-26 Wed 13:00] =>  1:30
:END:
 [2023-07-26 Wed 13:44]


* MEETING with                                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-06 Thu 09:00]--[2023-07-06 Thu 10:10] =>  1:10
:END:
[2023-07-06 Thu 09:00]

* MEETING with Managers                                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-14 Fri 10:58]--[2023-07-14 Fri 12:09] =>  1:11
:END:
[2023-07-14 Fri 10:58]

* MEETING with Justin & Zack RE QB Invoicing                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-18 Tue 14:28]--[2023-07-18 Tue 15:38] =>  1:10
:END:
[2023-07-18 Tue 14:28]


* MEETING with Proposify                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-25 Tue 09:57]--[2023-07-25 Tue 11:05] =>  1:08
:END:
[2023-07-25 Tue 09:57]
Bunch of shit i didn't care about because proposify


* MEETING with Ryan Saucerman RE backing up data                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-26 Wed 13:00]--[2023-07-26 Wed 13:40] =>  0:40
:END:
[2023-07-26 Wed 13:45]

- Need to order
  - [[https://www.amazon.com/StarTech-com-M-2-2-5in-SATA-Adapter/dp/B00ITJ7U20/ref=sr_1_2?crid=3S6PT1XJBD4MO&keywords=m2%2Bto%2Bsata%2Badapter&qid=1690396661&sprefix=m2%2Bto%2B%2Caps%2C164&sr=8-2&th=1][NVME to Sata adapater]]
  - [[https://www.amazon.com/Sabrent-External-Docking-Supports-DS-UTC1/dp/B07CSG4XM4/ref=sr_1_3?crid=Y2D5QIPMNJTA&keywords=external%2Busb%2Bdrive%2Bdock&qid=1690396633&sprefix=external%2Busb%2Bdrive%2Bdock%2Caps%2C181&sr=8-3&th=1][Docking bay USB C]]


* MEETING with Marketing                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-27 Thu 10:11]--[2023-07-27 Thu 10:47] =>  0:36
:END:
[2023-07-27 Thu 10:11]

* MEETING with Weekly Catch Up                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-31 Mon 13:03]--[2023-07-31 Mon 13:26] =>  0:23
:END:
[2023-07-31 Mon 13:03]


*** DONE Post infocom video to Linkedin
CLOSED: [2023-06-29 Thu 13:51] SCHEDULED: <2023-06-29 Thu 12:45>
:LOGBOOK:
CLOCK: [2023-06-29 Thu 12:00]--[2023-06-29 Thu 13:51] =>  1:51
:END:
 [2023-06-29 Thu 11:40]

** DONE Review Resources from Bridge Rev
CLOSED: [2023-08-07 Mon 14:26] SCHEDULED: <2023-08-07 Mon 13:30>
:PROPERTIES:
:Effort:   1:00
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-08-07 Mon 13:42]--[2023-08-07 Mon 14:26] =>  0:44
:END:

 [2023-05-03 Wed 15:23]

[[https://mail.google.com/mail/u/1/#search/from%3A(justin)/FMfcgzGsmNQBhsftwvRfcTNTtZZGXvCR][Email]]

** DONE Location Based Deal report
CLOSED: [2023-06-29 Thu 11:36] SCHEDULED: <2023-06-29 Thu 10:30>
:LOGBOOK:
CLOCK: [2023-06-29 Thu 10:05]--[2023-06-29 Thu 11:36] =>  1:31
:END:


* DONE Prep for marketing meeting
CLOSED: [2023-08-02 Wed 09:56] SCHEDULED: <2023-08-02 Wed 09:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-10-01 Sun 23:39
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-02 Wed 09:29]--[2023-08-02 Wed 09:56] =>  0:27
:END:
 [2023-08-02 Wed 09:29]


* DONE Create new Hubspot Graph
CLOSED: [2023-08-14 Mon 09:48] SCHEDULED: <2023-08-14 Mon>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-10-01 Sun 23:39
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-14 Mon 09:14]--[2023-08-14 Mon 09:48] =>  0:34
:END:
 [2023-08-14 Mon 08:38]

shows won deals per month in one color
shows almost certain deals in another color
shows certain deals in another color
gives us a total per month

should look like the Won Deals by Month (Events/Rental


* DONE Create report that shows YTD Events Rentals won vs last year YTD
CLOSED: [2023-08-14 Mon 09:07] SCHEDULED: <2023-08-14 Mon>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-10-01 Sun 23:39
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-14 Mon 08:40]--[2023-08-14 Mon 09:07] =>  0:27
:END:
 [2023-08-14 Mon 08:39]
 When i create a report and show for example a line chart i can activate the display option compared to year before. That's the option i searched.


* MEETING with Troy/Zack/Julie re: Weekly Marketing Meeting         :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-02 Wed 09:57]--[2023-08-02 Wed 10:51] =>  0:54
:END:
[2023-08-02 Wed 09:57]

* MEETING with Weekly Catchup                                       :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-07 Mon 13:04]--[2023-08-07 Mon 13:10] =>  0:06
:END:
[2023-08-07 Mon 13:04]

* MEETING with Clint re:Podcast                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-15 Tue 08:30]--[2023-08-15 Tue 08:43] =>  0:13
:END:
[2023-08-15 Tue 08:30]

* MEETING with Marketing Meeting                                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-31 Thu 10:11]--[2023-08-31 Thu 11:20] =>  1:09
:END:
[2023-08-31 Thu 10:11]

* PHONE Alpha Graphics re: Business cards                             :PHONE:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Phone Calls
:ARCHIVE_CATEGORY: phone
:ARCHIVE_TODO: PHONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-01 Tue 13:23]--[2023-08-01 Tue 13:36] =>  0:13
:END:
[2023-08-01 Tue 13:23]

* PHONE w/ Kyle re: Tiki Oasis                                        :PHONE:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Phone Calls
:ARCHIVE_CATEGORY: phone
:ARCHIVE_TODO: PHONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-02 Wed 11:35]--[2023-08-02 Wed 11:53] =>  0:18
:END:
[2023-08-02 Wed 11:35]

* DONE Podcast Recording - Angelica Robison
CLOSED: [2023-09-08 Fri 10:53] SCHEDULED: <2023-09-08 Fri 10:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   1:00
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-08 Fri 09:53]--[2023-09-08 Fri 10:53] =>  1:00
:END:
 [2023-09-06 Wed 13:45]


* DONE Transfer / Confirm footage from drives
CLOSED: [2023-09-27 Wed 11:21] SCHEDULED: <2023-09-20 Wed>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 13:59]--[2023-09-20 Wed 14:00] =>  0:01
:END:

 [2023-09-06 Wed 14:54]


* DONE Transfer Powur Footage
CLOSED: [2023-09-12 Tue 17:19] SCHEDULED: <2023-09-12 Tue>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-12 Tue 10:51]--[2023-09-12 Tue 11:51] =>  1:00
:END:
 [2023-09-12 Tue 10:37]


* DONE Plan the day/week
CLOSED: [2023-09-20 Wed 13:40] SCHEDULED: <2023-09-20 Wed 13:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 13:22]--[2023-09-20 Wed 13:40] =>  0:18
:END:
 [2023-09-20 Wed 13:22]


* DONE Help Ryan with Ap Install
CLOSED: [2023-09-25 Mon 16:37] SCHEDULED: <2023-09-25 Mon 12:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-25 Mon 13:00]--[2023-09-25 Mon 16:37] =>  3:37
:END:
 [2023-09-25 Mon 10:52]


* DONE Update Vendor Agreement documents on seas wbsite
CLOSED: [2023-09-27 Wed 11:30] SCHEDULED: <2023-09-27 Wed 11:21>
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-27 Wed 11:22]--[2023-09-27 Wed 11:30] =>  0:08
:END:

:PROPERTIES:
:CATEGORY: Task
:END:
 [2023-09-27 Wed 11:21]


* MEETING with Marketing Team                                       :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-06 Wed 09:59]--[2023-09-06 Wed 11:17] =>  1:18
:END:
[2023-09-06 Wed 09:59]

* MEETING with Ryan - IT Updates                                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-11 Mon 10:55]--[2023-09-11 Mon 11:26] =>  0:31
:END:
[2023-09-11 Mon 11:25]

* MEETING with  Marketing Meeting                                   :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-13 Wed 09:59]--[2023-09-13 Wed 10:58] =>  0:59
:END:
[2023-09-13 Wed 09:58]
* MEETING with Marketing                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 10:00]--[2023-09-20 Wed 11:13] =>  1:13
:END:
[2023-09-20 Wed 09:59]

* MEETING with Lasso (zoom)                                         :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-14 Thu 13:00]--[2023-09-14 Thu 13:28] =>  0:28
:END:
[2023-09-14 Thu 13:00]

Went through lasso setup and got zapier connection operational. Need to finish up proper data connections

* MEETING with Jeff (random google meet)                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 14:19]--[2023-09-20 Wed 14:40] =>  0:21
:END:
[2023-09-20 Wed 14:19]

* MEETING with Managers Meeting                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-21 Thu 11:18]--[2023-09-21 Thu 12:12] =>  0:54
:END:
[2023-09-21 Thu 11:18]
* MEETING with Weekly Marketing Meeting                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-11-02 Thu 14:32
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-27 Wed 12:55]--[2023-09-27 Wed 13:40] =>  0:45
:END:
[2023-09-27 Wed 12:55]

* HOLD  Look Book                                                :Julie:HOLD:
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-11-07 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Create Lead Magnets for Site
:ARCHIVE_CATEGORY: Project
:ARCHIVE_TODO: HOLD
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
- State "HOLD"       from "TODO"       [2023-09-06 Wed 13:49] \\
  Waiting till new year to do
- State "TODO"       from "WAITING"    [2023-08-06 Sun 23:03]
- State "WAITING"    from "TODO"       [2023-08-03 Thu 13:10] \\
  Waiting on Zack
- State "TODO"       from "WAITING"    [2023-08-01 Tue 21:05]
- State "WAITING"    from "NEXT"       [2023-07-28 Fri 13:37] \\
  Waiting for Zack and/or Sales
CLOCK: [2023-01-24 Tue 11:54]--[2023-01-24 Tue 12:28] =>  0:34
:END:
[2023-01-23 Mon 16:21]

** DONE Create Page dedicated to podcast
CLOSED: [2023-09-19 Tue 14:47] SCHEDULED: <2023-09-19 Tue 11:00>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-19 Tue 10:53]--[2023-09-19 Tue 13:17] =>  2:24
:END:

 [2023-08-29 Tue 09:52]

** DONE Upload Clint Bell Podcast
CLOSED: [2023-09-20 Wed 17:34] SCHEDULED: <2023-09-20 Wed 15:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-20 Wed 15:43]--[2023-09-20 Wed 17:34] =>  1:51
:END:
 [2023-09-20 Wed 13:21]


* DONE Setup Zapier  Hubspot -> Lasso mapping 
CLOSED: [2023-10-06 Fri 11:13] SCHEDULED: <2023-10-02 Mon 11:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-02 Mon 11:19]--[2023-10-02 Mon 15:25] =>  4:06
CLOCK: [2023-09-20 Wed 14:41]--[2023-09-20 Wed 15:43] =>  1:02
:END:
 [2023-09-20 Wed 13:35]

* DONE Plan The Day
CLOSED: [2023-10-02 Mon 11:18] SCHEDULED: <2023-10-02 Mon 10:45>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-02 Mon 10:41]--[2023-10-02 Mon 11:18] =>  0:37
CLOCK: [2023-10-02 Mon 10:41]--[2023-10-02 Mon 10:41] =>  0:00
:END:
 [2023-10-01 Sun 23:58]


* DONE Transfer Files for Nick/Brandis (Sendlane)
CLOSED: [2023-10-06 Fri 17:07] SCHEDULED: <2023-10-06 Fri>
:PROPERTIES:
:CATEGORY: Task
:Effort:   0:30
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 14:47]--[2023-10-06 Fri 14:50] =>  0:03
CLOCK: [2023-10-06 Fri 12:34]--[2023-10-06 Fri 12:51] =>  0:17
:END:
 [2023-10-06 Fri 12:28]
- 974 GB free

* DONE Weekly Review & Planning 
CLOSED: [2023-10-06 Fri 13:29] SCHEDULED: <2023-10-06 Fri 13:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   0:30
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 12:57]--[2023-10-06 Fri 13:29] =>  0:32
:END:
 [2023-10-06 Fri 12:56]


* DONE Add previous month ebay sales in hubspot
CLOSED: [2023-10-06 Fri 15:15] SCHEDULED: <2023-10-06 Fri 15:10>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
- State "NEXT"       from "WAITING"    [2023-10-06 Fri 15:07]
CLOCK: [2023-10-06 Fri 15:07]--[2023-10-06 Fri 15:15] =>  0:08
- State "WAITING"    from "TODO"       [2023-10-06 Fri 13:33] \\
  Email sent to Justin. Waiting on reply with values
CLOCK: [2023-10-06 Fri 13:29]--[2023-10-06 Fri 13:34] =>  0:05
:END:
 [2023-10-06 Fri 13:24]
 - June?
 - Aug
 - Sep


* DONE Clean up meeting notes and save on google drive. 
CLOSED: [2023-10-06 Fri 14:04] SCHEDULED: <2023-10-06 Fri 13:35>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 13:35]--[2023-10-06 Fri 14:04] =>  0:29
:END:
 [2023-10-06 Fri 13:33]


* DONE Create an auto-play for the vimeo video for flyer
CLOSED: [2023-10-11 Wed 12:09] SCHEDULED: <2023-10-11 Wed 11:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-11 Wed 11:28]--[2023-10-11 Wed 12:09] =>  0:41
:END:
 [2023-10-10 Tue 15:12]
*


* DONE Transfer Customer Care Footage
CLOSED: [2023-10-11 Wed 12:55]
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-11 Wed 12:14]--[2023-10-11 Wed 12:20] =>  0:06
:END:
 [2023-10-11 Wed 12:14]


* DONE Setup Dante
CLOSED: [2023-10-19 Thu 15:01] SCHEDULED: <2023-10-19 Thu 10:57>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-19 Thu 10:57]--[2023-10-19 Thu 11:00] =>  0:03
:END:
 [2023-10-19 Thu 10:57]


* MEETING with 10/4/23 Marketing Meeting                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-04 Wed 12:55]--[2023-10-04 Wed 14:35] =>  1:40
:END:
[2023-10-04 Wed 12:55]
* MEETING with 10/11/2023 Marketing Meeting                         :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-11 Wed 12:57]--[2023-10-11 Wed 13:38] =>  0:41
:END:
[2023-10-11 Wed 12:57]
* MEETING with Sales Team RE: Sales Process 10/19                   :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-19 Thu 14:58]--[2023-10-19 Thu 15:01] =>  0:03
:END:
[2023-10-19 Thu 14:58]

* MEETING with Richard re: Hubspot                                  :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-23 Mon 12:00]--[2023-10-23 Mon 13:44] =>  1:44
:END:
[2023-10-23 Mon 12:00]
had to trouble shoot signature and hubspot settings

* MEETING with Ops re: Carolyn Stern 10/25                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-25 Wed 15:30]--[2023-10-25 Wed 16:12] =>  0:42
:END:
[2023-10-25 Wed 15:30]

* MEETING with Ruben re: Hawaii Proposal                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-26 Thu 10:04]--[2023-10-26 Thu 11:01] =>  0:57
:END:
[2023-10-26 Thu 10:03]


***** 

:LOGBOOK:
CLOCK: [2023-10-26 Thu 15:22]--[2023-10-26 Thu 15:22] =>  0:00
:END:
[2023-10-26 Thu 15:22]

* MEETING with Troy & Julie re: CalSEA Shipping                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-27 Fri 08:58]--[2023-10-27 Fri 09:22] =>  0:24
:END:
[2023-10-27 Fri 08:58]

* PHONE with Ben from Expressive Strucures re:CalSEA                  :PHONE:
:PROPERTIES:
:ARCHIVE_TIME: 2023-12-01 Fri 12:08
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Phone Calls
:ARCHIVE_CATEGORY: phone
:ARCHIVE_TODO: PHONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-26 Thu 15:22]--[2023-10-26 Thu 15:33] =>  0:11
:END:
[2023-10-26 Thu 15:22]

* DONE Update Everyone's email address on their business cards
CLOSED: [2023-10-31 Tue 14:13] SCHEDULED: <2023-10-31 Tue 11:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-12-01 Fri 12:09
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Order Business Cards/Update Business Cards
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-31 Tue 12:27]--[2023-10-31 Tue 14:13] =>  1:46
:END:
 [2023-10-25 Wed 11:02]
 [[file:~/Orgfiles/SEAS.org::*Update Business Cards][Update Business Cards]]


* DONE Create business cards for all variations
CLOSED: [2023-10-06 Fri 12:26] SCHEDULED: <2023-10-06 Fri 11:15>
:PROPERTIES:
:CATEGORY: Task
:Effort:   2:00
:ARCHIVE_TIME: 2023-12-01 Fri 13:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Order Business Cards/Update Business Cards
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-06 Fri 11:42]--[2023-10-06 Fri 12:26] =>  0:44
CLOCK: [2023-10-06 Fri 11:34]--[2023-10-06 Fri 11:41] =>  0:07
:END:
 [2023-10-06 Fri 11:15]
- [X] Troy
- [X] Jteff
- [X] Michael
- [X] Zack
- [X] Erica
- [X] Ruben
- [X] Kyle
- [X] Tyler
- [X] Craig
- [ ] Richard

- 500x
  - Zack
  - Troy
  - Michael
  - Jeff
  - Richard
- 100x
  - Tyler
  - Erica
  - Ruben
  - Kyle
  - Craig
  - Sean
  - 
    


* CANCELLED Create Zap for gmail folders on Inquiry stage         :CANCELLED:
CLOSED: [2023-11-29 Wed 11:13]
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-01-02 Tue 15:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: CANCELLED
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
- State "CANCELLED"  from "NEXT"       [2023-11-29 Wed 11:13] \\
  No longer doing this as Lasso will hold the info
- State "NEXT"       from "WAITING"    [2023-11-07 Tue 13:40]
- State "WAITING"    from "TODO"       [2023-10-31 Tue 10:35] \\
  Hit a blocker on this as I need to get zack to login with his google drive for the automation
CLOCK: [2023-10-31 Tue 09:40]--[2023-10-31 Tue 10:34] =>  0:54
:END:
 [2023-10-31 Tue 09:39]


* DONE Replace Nick with Richard on Dashboards
CLOSED: [2023-11-30 Thu 16:27] SCHEDULED: <2023-11-30 Thu 13:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-01-02 Tue 15:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-11-30 Thu 16:18]--[2023-11-30 Thu 16:27] =>  0:09
:END:
 [2023-11-30 Thu 10:38]


* MEETING with Marketing 10/25                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-01-02 Tue 15:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-25 Wed 14:48]--[2023-10-25 Wed 14:48] =>  0:00
:END:
[2023-10-25 Wed 14:48]


MEETING
[2023-10-25 Wed 12:59]
1.1.
Recap From Last Week
1.1.1.
Questions
When should eblast (2nd week of jan, Jan 9th)
1.1.2.
Notes
1.
Meet next week re: CalSEA
Dedicated follow up email focused on events
Podcast recordings next week
1.1.3.
Takaway Tasks
1.
Tyler
Get with Ben & get walls printed
add next year's deliverables to next meeting
Move into new office
Final podcast update edits
1.2.
This Week
1.2.1.
Questions
What is our target date for the CalSEA Booth in-office for setup & Test?
10th nov whole week. Can we do this by then?
Any updates on graphics for Nov 16th Speaking engagement?
Happening Today.
1.2.2.
Notes
1.
Prior to Meeting
Placing Business card Order this week
10/25/23, 2:27 PM
file:///C:/Users/tyler/AppData/Roaming/Orgfiles/SEAS.html 2/2
Lots of last minute show/video needs
Dances With our Stars - downloadable link
Sanford
Customer Care
2. During Meeting
Talk through deliverables (move this through to December)
Need to plan for End of Year all hands
Julie will be taking on Proposal Support for Sales Team
1.2.3. Takeaway Tasks
1. Tyler
Edit Phil Mershon
Edit Angelica Robison
Upload Dances with our stars
Eblast Invite to show
Plan for content review, troy talk and podcast recording on [2023-11-12 Sun]
2. Julie
Work with Richard to setup office with decorations
Update Booth Graphics
Bottom: 4ft - 6ft
Richard Social Post to welcome to the team
Set aside 1 week after thanksgiving to book speaking engagements
3. Richard
Set meeting with PPC friend
Send Bio to Julie


* MEETING with CalSAE preperation Meeting                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-01-02 Tue 15:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-11-01 Wed 10:06]--[2023-11-01 Wed 10:48] =>  0:42
:END:
[2023-11-01 Wed 10:06]

- Happy hour open to everyone (5-6)
- 


* MEETING with Zack, Troy, Julie 11/08                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-01-02 Tue 15:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-11-08 Wed 14:20]--[2023-11-08 Wed 15:11] =>  0:51
:END:
[2023-11-08 Wed 14:20]

* MEETING with Marketing Team 11/1/2023                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-01-31 Wed 12:53
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-11-01 Wed 14:05]--[2023-11-01 Wed 14:32] =>  0:27
:END:
[2023-11-01 Wed 14:05]

* DONE Button for adding people to the mailing list.
CLOSED: [2023-07-03 Mon 14:04] SCHEDULED: <2023-06-29 Thu 13:00>
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Update SEAS Website
:ARCHIVE_CATEGORY: Project
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS ATTACH
:END:
:LOGBOOK:
CLOCK: [2023-06-27 Tue 13:32]--[2023-06-27 Tue 14:08] =>  0:36
:END:
 [2023-06-27 Tue 12:37]

Stay in touch

- Blog
- Newsletter
- Podcast
- In-Person Events


*** DONE Finish updates to Business Card
CLOSED: [2023-08-01 Tue 12:17] SCHEDULED: <2023-08-01 Tue 10:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-07-31 Mon 13:50]--[2023-07-31 Mon 16:23] =>  2:33
:END:
 [2023-07-31 Mon 11:37]

 Options:
 - Julie - 1 & 3
 - Tyler -  3 & 5

*** DONE Get AI print ready files together for AlphaPrint OS
CLOSED: [2023-08-01 Tue 15:47] SCHEDULED: <2023-08-01 Tue 14:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-08-01 Tue 12:58]--[2023-08-01 Tue 15:46] =>  2:48
:END:
 [2023-08-01 Tue 14:53]

* DONE Build Financial Dashboard
CLOSED: [2023-12-04 Mon 15:22] SCHEDULED: <2023-12-04 Mon 10:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-01 Fri 16:08]--[2023-12-01 Fri 17:52] =>  1:44
CLOCK: [2023-11-30 Thu 11:04]--[2023-11-30 Thu 11:31] =>  0:27
:END:
 [2023-11-30 Thu 10:37]

* DONE Plan SEAS Week/Month
CLOSED: [2023-12-01 Fri 15:33] SCHEDULED: <2023-12-01 Fri 15:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-01 Fri 14:41]--[2023-12-01 Fri 15:33] =>  0:52
CLOCK: [2023-12-01 Fri 14:35]--[2023-12-01 Fri 14:40] =>  0:05
CLOCK: [2023-12-01 Fri 14:09]--[2023-12-01 Fri 14:10] =>  0:01
:END:
 [2023-12-01 Fri 13:38]


* DONE Edit Zack & Troy Podcast 2
CLOSED: [2023-12-22 Fri 15:02] SCHEDULED: <2023-12-20 Wed 15:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-22 Fri 15:01]--[2023-12-22 Fri 15:02] =>  0:01
CLOCK: [2023-12-20 Wed 15:42]--[2023-12-22 Fri 12:07] => 44:25
:END:

 [2023-12-01 Fri 14:37]


* DONE Plan the day
CLOSED: [2023-12-18 Mon 12:24] SCHEDULED: <2023-12-18 Mon 11:35>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-18 Mon 11:36]--[2023-12-18 Mon 12:24] =>  0:48
:END:
 [2023-12-18 Mon 11:34]


* DONE Edit CalSAE Recap
CLOSED: [2023-12-19 Tue 14:41] SCHEDULED: <2023-12-18 Mon 12:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-18 Mon 12:35]--[2023-12-18 Mon 17:48] =>  5:13
:END:
 [2023-12-18 Mon 12:04]


* MEETING with Jordan (MPI)                                         :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-19 Tue 12:02]--[2023-12-19 Tue 12:16] =>  0:14
:END:
[2023-12-19 Tue 12:02]

* MEETING with Zack RE: Hubspot reports                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-05 Mon 09:42
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-22 Fri 12:07]--[2023-12-22 Fri 15:01] =>  2:54
:END:
[2023-12-22 Fri 12:07]





- Why dry rentals are not pushing to lasso
  - Fix in Zapier use format as RENTAL - Show Name here  || EVENT - SHOW NAME HERE  
- Fix hubspot subscription - Get renewal alternative 1 updated to include removing the extra sales seat [[https://app.hubspot.com/quote-center/23772871/renewals/15207464452?utm_campaign=CMKT%20%7C%20RM%20%7C%20Renewals%20Emails&utm_medium=email&utm_content=68005630&utm_source=hs_email][Renewal Overview]]
  
  
Cost Change
Cost Change %
Estimated Profit
Actual Profit


Keep
- Balance Due
- Estimated Margin
- Actual Margin
- Cost Change
- Cost Change %


Setup goals with Troy for next year.

- Sales Activity Dashboard
  - Add Aging (# of aging clients/customers)



- Workflow:
  - any contact in the database that has done a deal (histry of at least 1 deal) but have not done a deal in 300 days OR no contact in 90 Days move to live cycle stage of Aging
    - When someone hits Aging -> pops up on view for Julie and sends an email to the dealer.
      - Build report around aging numbers.     

* MEETING with Carolyn Stern, Matt and Kirin - Creative Update      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-03-18 Mon 13:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 13:49]--[2024-02-24 Sat 13:50] =>  0:01
:END:
[2024-02-24 Sat 13:49]

* MEETING with Carolyn/Kirin/Mia                                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-03-18 Mon 13:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-25 Sun 19:30]--[2024-02-25 Sun 21:49] =>  2:19
:END:
[2024-02-25 Sun 19:30]


* MEETING with  Carolyn/Matt/Kirin - Creative Update           :MEETING:NOTE:
:PROPERTIES:
:ARCHIVE_TIME: 2024-03-18 Mon 13:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 13:50]--[2024-02-24 Sat 13:50] =>  0:00
:END:
[2024-02-24 Sat 13:50]
* MEETING with Explore Digital re: Website refresh                  :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-04-01 Mon 11:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-09 Fri 10:31]--[2024-02-09 Fri 10:32] =>  0:01
:END:
[2024-02-09 Fri 10:31]


- Content
- Design process
- Mobile & desktop layouts CTAS
- Design around it
- Development
- SEO Foundational install -

pitfalls
- url matching i.e. replace a page but want it to be live
- Taking down a page and not replace it. 301 redirect
-

Show ideas:
- multiple series
- youtube.com/@delish
- Venue / location - t
-- mini venue review
-- Try
-- Before & After (potential of the event venue)
-- Venue reviues
-- Timelapse
-- Tik Tok


-- Poker night

-- dinner 17th - 20th 



* MEETING with Carolyn Stern                                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-04-01 Mon 11:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-12 Mon 15:16]--[2024-02-12 Mon 16:45] =>  1:29
:END:
[2024-02-12 Mon 15:15]


* MEETING with Troy & Julie RE: Carolyn Stern                  :MEETING:HOLD:
:PROPERTIES:
:ARCHIVE_TIME: 2024-04-01 Mon 11:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-15 Thu 09:02]--[2024-02-15 Thu 09:46] =>  0:44
:END:
[2024-02-15 Thu 09:02]


* MEETING with Carolyn - Creative review                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-04-01 Mon 11:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-21 Wed 15:38]--[2024-02-21 Wed 16:22] =>  0:44
:END:
[2024-02-21 Wed 15:38]


- Text message sound effect
- 

* MEETING with Explore Digital re: Website refresh                  :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-04-01 Mon 11:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-02-09 Fri 10:31]--[2024-02-09 Fri 10:32] =>  0:01
:END:
[2024-02-09 Fri 10:31]


- Content
- Design process
- Mobile & desktop layouts CTAS
- Design around it
- Development
- SEO Foundational install

pitfalls
- url matching i.e. replace a page but want it to be live
- Taking down a page and not replace it. 301 redirect
-

Show ideas:
- multiple series
- youtube.com/@delish
- Venue / location - t
-- mini venue review
-- Try
-- Before & After (potential of the event venue)
-- Venue reviues
-- Timelapse
-- Tik Tok


-- Poker night

-- dinner 17th - 20th 

** DONE Edit Clint Bell Podcast Clips
CLOSED: [2023-09-18 Mon 14:31] SCHEDULED: <2023-09-18 Mon 13:45>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-18 Mon 13:43]--[2023-09-18 Mon 14:31] =>  0:48
:END:

[2023-09-06 Wed]

* DONE Edit Tina Marie Podcast
CLOSED: [2023-09-08 Fri 15:11] SCHEDULED: <2023-09-08 Fri 12:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-08 Fri 12:33]--[2023-09-08 Fri 15:11] =>  2:38
:END:
 [2023-08-29 Tue 09:11]


* DONE Edit Phil Mershon Podcast
CLOSED: [2023-11-02 Thu 12:41] SCHEDULED: <2023-11-01 Wed 12:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-11-01 Wed 14:32]--[2023-11-02 Thu 09:49] => 19:17
CLOCK: [2023-11-01 Wed 12:23]--[2023-11-01 Wed 14:05] =>  1:42
CLOCK: [2023-10-31 Tue 15:23]--[2023-10-31 Tue 16:26] =>  1:03
:END:

 [2023-09-06 Wed 14:54]


* DONE Transfer Angelica Robison Footage
CLOSED: [2023-09-08 Fri 16:30] SCHEDULED: <2023-09-08 Fri 15:10>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-09-08 Fri 15:11]--[2023-09-08 Fri 16:30] =>  1:19
:END:
 [2023-09-08 Fri 15:11]


* DONE Edit Lasso Podcast
CLOSED: [2023-10-16 Mon 15:38] SCHEDULED: <2023-10-17 Tue 10:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-10-13 Fri 11:13]--[2023-10-13 Fri 14:09] =>  2:56
:END:
 [2023-10-11 Wed 11:19]


* DONE Edit Zack & Troy Podcast 1
CLOSED: [2023-12-07 Thu 14:29] SCHEDULED: <2023-12-05 Tue 13:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-12-05 Tue 12:57]--[2023-12-06 Wed 16:54] => 27:57
:END:
 [2023-12-01 Fri 14:01]


* DONE Edit Carolyn Stern Podcast
CLOSED: [2024-04-03 Wed 14:47] SCHEDULED: <2024-04-03 Wed 11:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   2:00
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-04-03 Wed 13:49]--[2024-04-03 Wed 14:47] =>  0:58
CLOCK: [2024-04-03 Wed 10:58]--[2024-04-03 Wed 12:00] =>  1:02
:END:
 [2024-04-01 Mon 13:49]


* DONE Create Carolyn Stern Preview Clip
CLOSED: [2024-04-03 Wed 15:22] SCHEDULED: <2024-04-03 Wed 15:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   0:30
:ARCHIVE_TIME: 2024-04-15 Mon 10:23
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Editing
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-04-03 Wed 14:47]--[2024-04-03 Wed 15:22] =>  0:35
:END:
 [2024-04-01 Mon 13:50]


* DONE Work on Website strucutre outline
CLOSED: [2024-03-22 Fri 10:04] SCHEDULED: <2024-03-20 Wed 11:15>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-19 Tue 13:44]--[2024-03-19 Tue 13:51] =>  0:07
CLOCK: [2024-03-19 Tue 12:52]--[2024-03-19 Tue 13:43] =>  0:51
CLOCK: [2024-03-18 Mon 13:42]--[2024-03-18 Mon 16:10] =>  2:28
- State "NEXT"       from "HOLD"       [2024-03-18 Mon 13:42]
:END:
 [2024-03-18 Mon 10:36]


* DONE Prep podcast room for records
CLOSED: [2024-03-26 Tue 12:00] SCHEDULED: <2024-03-26 Tue 11:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-26 Tue 11:00]--[2024-03-26 Tue 12:00] =>  1:00
:END:
 [2024-03-26 Tue 11:00]


* DONE Lasso Training
CLOSED: [2024-03-27 Wed 15:39] SCHEDULED: <2024-03-27 Wed 08:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-27 Wed 08:00]--[2024-03-27 Wed 15:39] =>  7:39
:END:
 [2024-03-27 Wed 15:08]


* MEETING with Tom Stimson                                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-13 Wed 09:08]--[2024-03-13 Wed 09:52] =>  0:44
:END:
[2024-03-13 Wed 09:08]

* MEETING with Troy/Zack/Julie Marketing Meeting                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-14 Thu 13:00]--[2024-03-14 Thu 13:38] =>  0:38
:END:
[2024-03-14 Thu 13:00]
* MEETING with Jeff - tracking issue                                :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-19 Tue 13:51]--[2024-03-19 Tue 13:54] =>  0:03
:END:
[2024-03-19 Tue 13:51]
* MEETING with Zack/Julie Drip Campaign                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-20 Wed 14:04]--[2024-03-20 Wed 14:36] =>  0:32
:END:
[2024-03-20 Wed 14:04]
* MEETING with Josh re hubspot/email fix                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-22 Fri 10:39]--[2024-03-22 Fri 11:25] =>  0:46
:END:
[2024-03-22 Fri 10:39]

* MEETING with Weekly catchup meeting                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-25 Mon 13:02]--[2024-03-25 Mon 13:30] =>  0:28
:END:
[2024-03-25 Mon 13:02]

* MEETING with Podcast Recording with Troy & Zack           :MEETING:PODCAST:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-25 Mon 15:26]--[2024-03-25 Mon 16:32] =>  1:06
:END:
[2024-03-25 Mon 15:26]

* MEETING with Podcast Record with Stephen                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-26 Tue 11:57]--[2024-03-26 Tue 12:49] =>  0:52
:END:
[2024-03-26 Tue 11:57]

* MEETING with Podcast recording Yinka                         :MEETING:NOTE:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-01 Wed 08:52
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-26 Tue 13:54]--[2024-03-26 Tue 14:16] =>  0:22
:END:
[2024-03-26 Tue 13:54]


* DONE Work on Website strucutre outline
CLOSED: [2024-03-22 Fri 10:04] SCHEDULED: <2024-03-20 Wed 11:15>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-05-07 Tue 14:48
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-19 Tue 13:44]--[2024-03-19 Tue 13:51] =>  0:07
CLOCK: [2024-03-19 Tue 12:52]--[2024-03-19 Tue 13:43] =>  0:51
CLOCK: [2024-03-18 Mon 13:42]--[2024-03-18 Mon 16:10] =>  2:28
- State "NEXT"       from "HOLD"       [2024-03-18 Mon 13:42]
:END:
 [2024-03-18 Mon 10:36]


* DONE Prep podcast room for records
CLOSED: [2024-03-26 Tue 12:00] SCHEDULED: <2024-03-26 Tue 11:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-26 Tue 11:00]--[2024-03-26 Tue 12:00] =>  1:00
:END:
 [2024-03-26 Tue 11:00]


* DONE Lasso Training
CLOSED: [2024-03-27 Wed 15:39] SCHEDULED: <2024-03-27 Wed 08:00>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-27 Wed 08:00]--[2024-03-27 Wed 15:39] =>  7:39
:END:
 [2024-03-27 Wed 15:08]


* MEETING with Tom Stimson                                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-13 Wed 09:08]--[2024-03-13 Wed 09:52] =>  0:44
:END:
[2024-03-13 Wed 09:08]

* MEETING with Troy/Zack/Julie Marketing Meeting                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-14 Thu 13:00]--[2024-03-14 Thu 13:38] =>  0:38
:END:
[2024-03-14 Thu 13:00]
* MEETING with Jeff - tracking issue                                :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-19 Tue 13:51]--[2024-03-19 Tue 13:54] =>  0:03
:END:
[2024-03-19 Tue 13:51]
* MEETING with Zack/Julie Drip Campaign                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-20 Wed 14:04]--[2024-03-20 Wed 14:36] =>  0:32
:END:
[2024-03-20 Wed 14:04]
* MEETING with Josh re hubspot/email fix                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-22 Fri 10:39]--[2024-03-22 Fri 11:25] =>  0:46
:END:
[2024-03-22 Fri 10:39]

* MEETING with Weekly catchup meeting                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-25 Mon 13:02]--[2024-03-25 Mon 13:30] =>  0:28
:END:
[2024-03-25 Mon 13:02]

* MEETING with Podcast Recording with Troy & Zack           :MEETING:PODCAST:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-25 Mon 15:26]--[2024-03-25 Mon 16:32] =>  1:06
:END:
[2024-03-25 Mon 15:26]

* MEETING with Podcast Record with Stephen                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-26 Tue 11:57]--[2024-03-26 Tue 12:49] =>  0:52
:END:
[2024-03-26 Tue 11:57]

* MEETING with Podcast recording Yinka                         :MEETING:NOTE:
:PROPERTIES:
:ARCHIVE_TIME: 2024-05-07 Tue 14:49
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-03-26 Tue 13:54]--[2024-03-26 Tue 14:16] =>  0:22
:END:
[2024-03-26 Tue 13:54]


* DONE Transfer UTI Womens to drive then transfer to PC
CLOSED: [2024-05-15 Wed 13:11] SCHEDULED: <2024-05-08 Wed>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-08 Wed 11:19]--[2024-05-10 Fri 17:03] => 53:44
:END:
 [2024-05-07 Tue 10:55]


* MEETING with Troy re: Graphiquie Quote                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-08 Wed 10:00]--[2024-05-08 Wed 10:12] =>  0:12
:END:
[2024-05-08 Wed 10:00]
* MEETING re: Marketing Meeting                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-08 Wed 13:02]--[2024-05-08 Wed 13:42] =>  0:40
:END:
[2024-05-08 Wed 13:02]
* MEETING re: Hampton Events                                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-10 Fri 10:59]--[2024-05-10 Fri 11:14] =>  0:15
:END:
[2024-05-10 Fri 10:59]
* MEETING re: Weekly Marketing (Website Update)                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-15 Wed 13:15]--[2024-05-15 Wed 14:39] =>  1:24
:END:
[2024-05-15 Wed 13:15]
* MEETING with Tom & Zack                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-23 Thu 12:58]--[2024-05-23 Thu 13:40] =>  0:42
:END:
[2024-05-23 Thu 12:58]
* MEETING re: Weekly Marketing                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-22 Wed 09:22]--[2024-05-22 Wed 09:57] =>  0:35
:END:
[2024-05-22 Wed 09:22]
* MEETING re: Hampton Events                                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-10 Fri 10:59]--[2024-05-10 Fri 11:14] =>  0:15
:END:
[2024-05-10 Fri 10:59]
* MEETING with Doron re Website                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-09 Tue 15:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-05-23 Thu 13:59]--[2024-05-23 Thu 15:09] =>  1:10
:END:
[2024-05-23 Thu 13:59]
* MEETING re DOW JONES Security                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-08-02 Fri 10:51
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-24 Mon 14:08]--[2024-06-24 Mon 14:49] =>  0:41
:END:
[2024-06-24 Mon 14:08]
* MEETING with Monthly Managers Meeting                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-08-02 Fri 10:51
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-28 Fri 09:18]--[2024-06-28 Fri 09:57] =>  0:39
:END:
[2024-06-28 Fri 09:18]
* MEETING re: Cutwater                                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-08-02 Fri 10:59
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-27 Thu 10:04]--[2024-06-27 Thu 10:20] =>  0:16
:END:
[2024-06-27 Thu 10:04]
* MEETING Cutwater                                                  :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-08-02 Fri 10:59
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-27 Thu 13:31]--[2024-06-27 Thu 14:15] =>  0:44
:END:
[2024-06-27 Thu 13:31]
*** DONE Create SEAS Graphics for LEAP
CLOSED: [2024-02-05 Mon 16:54] SCHEDULED: <2024-02-05 Mon 10:30>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-05 Mon 10:29]--[2024-02-05 Mon 16:54] =>  6:25
:END:
 [2024-02-05 Mon 09:41]

*** DONE Create Motion Graphics
CLOSED: [2024-02-24 Sat 10:42] SCHEDULED: <2024-02-24 Sat 10:45>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 10:38]--[2024-02-24 Sat 10:42] =>  0:04
CLOCK: [2024-02-22 Thu 13:09]--[2024-02-22 Thu 17:19] =>  4:10
:END:
 [2024-02-22 Thu 13:08]
 [[file:~/Orgfiles/SEAS.org::*LEAP Conference][LEAP Conference]]

**** DONE 07 - F-Word - F*** (Text animation)
CLOSED: [2024-02-24 Sat 16:43]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 15:51]--[2024-02-24 Sat 16:43] =>  0:52
:END:
  [2024-02-24 Sat]

**** DONE 09 - Rule #1 -  Motion Text
CLOSED: [2024-02-24 Sat 14:00]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 13:53]--[2024-02-24 Sat 14:00] =>  0:07
:END:
  [2024-02-24 Sat]

**** DONE 10. - Rule #2 - Motion Text
CLOSED: [2024-02-24 Sat 15:17]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 14:47]--[2024-02-24 Sat 15:17] =>  0:30
CLOCK: [2024-02-24 Sat 14:00]--[2024-02-24 Sat 14:16] =>  0:16
:END:
  [2024-02-24 Sat]

**** DONE 11. - Rule #3 - Motion Text
CLOSED: [2024-02-24 Sat 15:47]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-24 Sat 15:17]--[2024-02-24 Sat 15:47] =>  0:30
:END:
  [2024-02-24 Sat]

**** DONE 30 - motion text
CLOSED: [2024-02-25 Sun 13:56]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-25 Sun 13:33]--[2024-02-25 Sun 13:56] =>  0:23
:END:
  [2024-02-24 Sat]

**** DONE 54 - The approach looks like this (fill in the blank) text image style
CLOSED: [2024-02-25 Sun 12:05]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-02-25 Sun 10:55]--[2024-02-25 Sun 12:05] =>  1:10
:END:
  [2024-02-24 Sat]
SLIDE: The approach looks like this:
When you did ________ 
I felt _________ 
What I would like you to do in the future is __________ 
Would you be willing to ___________?
How this will benefit us is _______ 

** CANCELLED Update Leap Content [38%]                           :CANCELLED:
CLOSED: [2024-06-11 Tue 12:27]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "CANCELLED"  from "WAITING"    [2024-06-11 Tue 12:27] \\
  This doesn't seem to be happening anymore
- State "WAITING"    from "HOLD"       [2024-04-25 Thu 11:19] \\
  Waiting for Kirin to get back to me
CLOCK: [2024-03-13 Wed 15:21]--[2024-03-13 Wed 17:10] =>  1:49
:END:
 [2024-03-11 Mon 14:31]

- [ ] podcast video (all angles) send on google drive to carolyn
- [ ] Update Text Message
- [X] Myth #1 - Positve emotions are Good (cuts at Go in good) 
- [ ] Myth # 3 - Title (myth 3) jumps down
- [ ] Myth and Fact Title and text spacing need to all be the same and match the current distance on the Myth #1 slide.
- [ ] All citations need parenthesis and update (Kirin will provide details)
- [ ] Change 8.8 trillion to have USD (Kirin will update me)
- [X] 1 in 3 animation start text after only 3 people showing
- [X] Check for font differece in what are you feeling
   - [X] add bullets and do a typewriter (word not charater) animation top to bottom
- [X] Emotional expression needs to typewriter in
- [ ] Beneftis line all the same (note the bottom is too short) - Carolyn's team is checking the citation.
- [X] Heart fix the grey overlap on heart
- [ ] Make an alternate slide starting with High EI Way (same as first time it's shown) then zoom to full model



* CANCELLED Break                                                 :CANCELLED:
CLOSED: [2024-07-11 Thu 12:34]
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: CANCELLED
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2024-07-11 Thu 12:34] \\
  not using this
CLOCK: [2024-04-03 Wed 12:17]--[2024-04-03 Wed 12:28] =>  0:11
CLOCK: [2024-04-01 Mon 15:45]--[2024-04-01 Mon 16:00] =>  0:15
:END:
 [2024-04-01 Mon 15:38]


* MEETING re: Summer Camp                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-10 Mon 10:22]--[2024-06-10 Mon 12:57] =>  2:35
:END:
[2024-06-10 Mon 10:21]
* MEETING re Dow Jones Opus                                         :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-11 Tue 11:54]--[2024-06-11 Tue 12:40] =>  0:46
:END:
[2024-06-11 Tue 11:54]
* MEETING re: Weekly Marketing Meeting                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-12 Wed 15:58]--[2024-06-12 Wed 17:24] =>  1:26
:END:
[2024-06-12 Wed 15:58]
* MEETING team re website                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-06-26 Wed 15:04]--[2024-06-26 Wed 16:42] =>  1:38
:END:
[2024-06-26 Wed 15:04]
* MEETING with  Marketing Team:MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:

:LOGBOOK:
CLOCK: [2024-07-03 Wed 13:02]--[2024-07-03 Wed 15:26] =>  2:24
:END:
[2024-07-03 Wed 13:02]
* MEETING re: Nami - June 2025 Event                                :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-07-29 Mon 10:10]--[2024-07-29 Mon 10:55] =>  0:45
:END:
[2024-07-29 Mon 10:10]
* MEETING re:Sales                                                  :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-09-03 Tue 13:41
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-07-30 Tue 09:02]--[2024-07-30 Tue 09:56] =>  0:54
:END:
[2024-07-30 Tue 09:02]
* MEETING re Associations 2030                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-10-07 Mon 12:17
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-07-29 Mon 10:58]--[2024-07-29 Mon 11:20] =>  0:22
:END:
[2024-07-29 Mon 10:58]
* MEETING re: Weekly Marketing Meeting                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-10-07 Mon 12:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-08-07 Wed 13:02]--[2024-08-07 Wed 13:35] =>  0:33
:END:
[2024-08-07 Wed 13:02]
* MEETING re Marketin                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-10-07 Mon 12:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-08-16 Fri 09:03]--[2024-08-16 Fri 09:32] =>  0:29
:END:
[2024-08-16 Fri 09:03]
* MEETING with CALSAE                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-10-07 Mon 12:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-08-16 Fri 10:01]--[2024-08-16 Fri 10:28] =>  0:27
:END:
[2024-08-16 Fri 10:01]
* MEETING RE LInkedin Messaging                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-10-07 Mon 12:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-08-23 Fri 11:01]--[2024-08-23 Fri 11:12] =>  0:11
:END:
[2024-08-23 Fri 11:01]
* MEETING re: Weekly Marketing Meeting                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-10-07 Mon 12:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-08-07 Wed 13:02]--[2024-08-07 Wed 14:22] =>  1:20
:END:
[2024-08-07 Wed 13:02]
* DONE Record Troy / Sukki 
CLOSED: [2024-01-30 Tue 15:03] SCHEDULED: <2024-01-30 Tue 12:00>
:PROPERTIES:
:CATEGORY: Task
:Effort:   3:00
:ARCHIVE_TIME: 2024-10-29 Tue 13:43
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/Podcast Recordings
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS CONTENT
:END:
:LOGBOOK:
CLOCK: [2024-01-30 Tue 13:25]--[2024-01-30 Tue 15:03] =>  1:38
:END:
 [2024-01-30 Tue 09:29]


* MEETING re World Chemical Forum (WCF) Graphics Review         :MEETING:WCF:
:PROPERTIES:
:ARCHIVE_TIME: 2024-11-05 Tue 14:15
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-07-31 Wed 10:02]--[2024-07-31 Wed 11:06] =>  1:04
:END:
[2024-07-31 Wed 10:02]
* MEETING re Taco Tuesday                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-11-05 Tue 14:15
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-09-13 Fri 10:28]--[2024-09-13 Fri 17:40] =>  7:12
:END:
[2024-09-13 Fri 10:28]
* MEETING  re: Cutwater Animation Production                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-11-05 Tue 14:15
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-09-09 Mon 12:29]--[2024-09-09 Mon 12:39] =>  0:10
:END:
[2024-09-09 Mon 12:29]
* MEETING re Cutwater                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-11-05 Tue 14:15
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-09-05 Thu 11:43]--[2024-09-05 Thu 14:07] =>  2:24
:END:
[2024-09-05 Thu 11:43]
* MEETING re: Marketing Metting                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-09-04 Wed 13:33]--[2024-09-04 Wed 15:27] =>  1:54
:END:
[2024-09-04 Wed 13:33]
* MEETING re: Weekly Marketing Meeting                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-09-11 Wed 12:57]--[2024-09-11 Wed 13:48] =>  0:51
:END:
[2024-09-11 Wed 12:57]
* MEETING re: Weekly Marketing Meeting                              :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-09-11 Wed 12:57]--[2024-09-11 Wed 13:48] =>  0:51
:END:
[2024-09-11 Wed 12:57]
* MEETING re Cutwater Content                                       :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-10-02 Wed 09:33]--[2024-10-02 Wed 09:58] =>  0:25
:END:
[2024-10-02 Wed 09:33]
* MEETING re: Marketing Meeting                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-10-09 Wed 13:04]--[2024-10-09 Wed 13:31] =>  0:27
:END:
[2024-10-09 Wed 13:04]
* MEETING re: Weekly Catchup                                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-10-14 Mon 13:05]--[2024-10-14 Mon 13:34] =>  0:29
:END:
[2024-10-14 Mon 13:05]
* MEETING re: Marketing                                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2024-12-09 Mon 18:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2024-10-23 Wed 13:03]--[2024-10-23 Wed 13:12] =>  0:09
:END:
[2024-10-23 Wed 13:03]
